; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation8 - direction
	Star3 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star5 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star3)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument4 spectrograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation8)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 image0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation8)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 Star9)
	(supports instrument8 image0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 Star5)
	(supports instrument9 spectrograph1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 Star9)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
	(supports instrument10 image0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation4)
	(calibration_target instrument10 GroundStation6)
	(supports instrument11 spectrograph1)
	(supports instrument11 image0)
	(calibration_target instrument11 Star5)
	(supports instrument12 spectrograph1)
	(supports instrument12 image0)
	(calibration_target instrument12 Star5)
	(calibration_target instrument12 GroundStation7)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite2 Star5)
	(pointing satellite3 Star10)
	(have_image Star10 spectrograph1)
	(have_image Planet11 image0)
	(have_image Star12 spectrograph1)
	(have_image Star13 image0)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 image0)
))

)

; plan
1. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 9
2. (calibrate satellite3 instrument4 groundstation8)
   added: (calibrated instrument4)
   goals met: 1 of 9
3. (turn_to satellite3 planet15 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 planet15)
   goals met: 1 of 9
4. (take_image satellite3 planet15 instrument4 image0)
   added: (have_image planet15 image0)
   goals met: 2 of 9
5. (turn_to satellite3 planet14 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet14)
   goals met: 2 of 9
6. (take_image satellite3 planet14 instrument4 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 3 of 9
7. (turn_to satellite3 planet11 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet11)
   goals met: 3 of 9
8. (turn_to satellite0 groundstation6 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 9
9. (take_image satellite3 planet11 instrument4 image0)
   added: (have_image planet11 image0)
   goals met: 5 of 9
10. (turn_to satellite3 star12 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star12)
   goals met: 5 of 9
11. (take_image satellite3 star12 instrument4 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 6 of 9
12. (turn_to satellite3 star13 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star13)
   goals met: 6 of 9
13. (take_image satellite3 star13 instrument4 image0)
   added: (have_image star13 image0)
   goals met: 7 of 9
14. (turn_to satellite3 star10 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star10)
   goals met: 8 of 9
15. (take_image satellite3 star10 instrument4 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 9 of 9
